
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 2 to change, 8 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.DB-URL[0]
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
* Replace
  * azurerm_postgresql_flexible_server_configuration.extensions[0]
  * module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;dashboard&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana00&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana01&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana1000&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana1001&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.DB-URL[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "DB-URL" {
        id                      = "https://dtsse-prod.vault.azure.net/secrets/db-url/f17ab232a306497d967970cbc1006d2b"
        name                    = "db-url"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_postgresql_flexible_server_configuration.extensions[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "extensions" {
      ~ id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod/providers/Microsoft.Resources/deployments/DTSSE_Alert"
        name                     = "DTSSE_Alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_password_wo_version = 0 -> null
      + delegated_subnet_id               = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/postgresql" # forces replacement
      ~ fqdn                              = "dtsse-dashboard-flexdb-prod.postgres.database.azure.com" -> (known after apply)
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply)
        name                              = "dtsse-dashboard-flexdb-prod"
      + private_dns_zone_id               = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      ~ public_network_access_enabled     = true -> false
      ~ storage_tier                      = "P6" -> (known after apply)
        tags                              = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "production"
            "managedBy"           = "DTS Software Engineering"
        }
      - zone                              = "1" -> null
        # (13 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases["dashboard"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/databases/dashboard" -> (known after apply)
        name      = "dashboard"
      ~ server_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana00"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      ~ id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/firewallRules/grafana00" -> (known after apply)
        name             = "grafana00"
      ~ server_id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana01"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      ~ id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/firewallRules/grafana01" -> (known after apply)
        name             = "grafana01"
      ~ server_id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana1000"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      ~ id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/firewallRules/grafana1000" -> (known after apply)
        name             = "grafana1000"
      ~ server_id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana1001"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      ~ id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/firewallRules/grafana1001" -> (known after apply)
        name             = "grafana1001"
      ~ server_id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 8 to add, 2 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":195,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->